spec/dummy/app/controllers/admin/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["title", "Test article1"], ["updated_at", Wed, 11 Sep 2013 12:00:17 UTC +00:00]]
---
  def update
    @article = Article.find(params[:id])
    redirect_or_edit(@article, @article.update(article_params))